# Reset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerIterator..::..Reset Method
RebarContainerIterator Class See Also
---
Resets the iterator to the initial state.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# See Also
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace